AddictiveInstruments/ADIOS/adios/STM32F4xx/adios_adc.c
//! \defgroup ADIOS_ADC
//!
//! ADC driver for ADIOS - STM32F4xx
//!
//! See include/adios/adios_adc.h for the API and its settings; this file
//! is about the silicon.
//!
//!
//! ONE OR THREE ADCs, DEPENDING ON THE LINE
//! ========================================
//!
//! Verified in the CMSIS headers of all 23 F4 devices in the tree, not
//! assumed:
//!
//!     ADC1 only ....... F401, F410, F411, F412, F413, F423
//!     ADC1+ADC2+ADC3 .. F405, F407, F415, F417, F427, F429, F437, F439,
//!                       F446, F469, F479
//!
//! The guards below are #if defined(ADC2) / defined(ADC3), never a list of
//! part numbers: the CMSIS header for the chip already knows, and a list
//! written by hand is a list that goes stale.
//!
//! Each instance runs INDEPENDENTLY here - its own channel mask, its own DMA
//! stream, its own scan. The dual and triple SIMULTANEOUS modes are NOT
//! implemented: they sample several ADCs on one trigger, which serves motor
//! control and costs the freedom to give each instance its own channel
//! count. Halving a scan time that way also ties the instances together in
//! the result buffer, where one DMA stream then carries interleaved pairs.
//!
//!
//! CHANNEL MAP
//! ===========
//!
//! ADC1 and ADC2 share one map, contiguous from 0 to 15 - unlike the G0,
//! whose internal measurements sit in the middle of the range:
//!
//!     0..7   PA0..PA7
//!     8, 9   PB0, PB1
//!     10..15 PC0..PC5
//!     16     temperature sensor (*)   17  VREFINT     18  VBAT (*)
//!
//! ADC3 has a map of its own, and half of it is on PORTF:
//!
//!     0..3   PA0..PA3
//!     4..8   PF6..PF10       9   PF3
//!     10..13 PC0..PC3
//!     14, 15 PF4, PF5
//!
//! PORTF only exists from LQFP144 up. On an LQFP100 or smaller, ADC3 is
//! real but only channels 0..3 and 10..13 can be reached. Nothing here
//! prevents selecting the others; the pins simply are not bonded.
//!
//! (*) The temperature sensor is channel 16 on F401, F405, F407, F410, F415
//! and F417, but channel 18 SHARED WITH VBAT on every other F4 - and the
//! reference manual is explicit that only one of the two measurement paths
//! may be enabled at a time. Both are internal, so neither is reachable
//! through the channel masks below, which are for pins.
//!
//!
//! NO HARDWARE OVERSAMPLING ON THIS FAMILY
//! =======================================
//!
//! The STM32G0 has an oversampler in the peripheral; this family has none -
//! searching the whole F4 LL for the pattern returns nothing.
//! ADIOS_ADC_OVERSAMPLING_RATE is therefore honoured by accumulating in the
//! DMA interrupt. Same knob, same number, more CPU.
//!
//! \{
/* ==========================================================================
 *
 *  Copyright (C) 2026 Bruno Dupeyron (addictive.instruments@gmail.com)
 *  Licensed under MIT License.
 *  See the LICENSE file in the project root for full licence information.
 *
 * ==========================================================================
 */

/////////////////////////////////////////////////////////////////////////////
// Include files
/////////////////////////////////////////////////////////////////////////////

#include <adios.h>

// this module can be optionally disabled in a local adios_config.h file (included from adios.h)
#if defined(ADIOS_USE_ADC)


/////////////////////////////////////////////////////////////////////////////
// Tier check - which ADC instances this chip actually has
/////////////////////////////////////////////////////////////////////////////

// The #else after these closes only at the end of the file: #error does not
// stop GCC, it records a message and carries on, so without it the real
// diagnostic would be buried under the secondary errors of a body that
// cannot compile anyway.
#if !defined(ADIOS_USE_ADC0) && !defined(ADIOS_USE_ADC1) && !defined(ADIOS_USE_ADC2)
# error "ADIOS_USE_ADC is set, but no ADC port was selected. Define ADIOS_USE_ADC0 for ADC1, ADIOS_USE_ADC1 for ADC2, ADIOS_USE_ADC2 for ADC3."
#elif defined(ADIOS_USE_ADC1) && !defined(ADC2)
# error "ADIOS_USE_ADC1 (ADC2) requested, but this STM32F4 has only ADC1. A second ADC exists on F405/F407/F415/F417/F427/F429/F437/F439/F446/F469/F479 only."
#elif defined(ADIOS_USE_ADC2) && !defined(ADC3)
# error "ADIOS_USE_ADC2 (ADC3) requested, but this STM32F4 has only ADC1. A third ADC exists on F405/F407/F415/F417/F427/F429/F437/F439/F446/F469/F479 only."
#else

// Channels 16, 17 and 18 are internal on this family too, and are reached
// through their own LL constants rather than through a pin mask.
#if defined(ADIOS_USE_ADC0) && (ADIOS_ADC0_CHANNEL_MASK & ~0x0000ffff)
# error "ADIOS_ADC0_CHANNEL_MASK selects a channel above 15. On STM32F4 the external inputs are channels 0..15; 16, 17 and 18 are the temperature sensor, VREFINT and VBAT."
#endif
#if defined(ADIOS_USE_ADC1) && (ADIOS_ADC1_CHANNEL_MASK & ~0x0000ffff)
# error "ADIOS_ADC1_CHANNEL_MASK selects a channel above 15. On STM32F4 the external inputs are channels 0..15."
#endif
#if defined(ADIOS_USE_ADC2) && (ADIOS_ADC2_CHANNEL_MASK & ~0x0000ffff)
# error "ADIOS_ADC2_CHANNEL_MASK selects a channel above 15. On STM32F4 the external inputs are channels 0..15."
#endif

#if defined(ADIOS_USE_ADC0) && !ADIOS_ADC0_CHANNEL_MASK
# warning "ADIOS_USE_ADC0 is set but ADIOS_ADC0_CHANNEL_MASK is 0: ADC1 will be initialised and convert nothing."
#endif
#if defined(ADIOS_USE_ADC1) && !ADIOS_ADC1_CHANNEL_MASK
# warning "ADIOS_USE_ADC1 is set but ADIOS_ADC1_CHANNEL_MASK is 0: ADC2 will be initialised and convert nothing."
#endif
#if defined(ADIOS_USE_ADC2) && !ADIOS_ADC2_CHANNEL_MASK
# warning "ADIOS_USE_ADC2 is set but ADIOS_ADC2_CHANNEL_MASK is 0: ADC3 will be initialised and convert nothing."
#endif


/////////////////////////////////////////////////////////////////////////////
// Overridable settings
/////////////////////////////////////////////////////////////////////////////

// ADC kernel clock, common to all three instances (it lives in ADC_CCR).
// APB2 divided by 4 keeps the ADC below its 36 MHz maximum on a 168 MHz F407.
#ifndef ADIOS_ADC_CLOCK_SOURCE
#define ADIOS_ADC_CLOCK_SOURCE LL_ADC_CLOCK_SYNC_PCLK_DIV4
#endif

// Sampling time, applied to every selected channel. 144 cycles suits a pot
// through a few kilo-ohms; lower it for a low impedance source.
#ifndef ADIOS_ADC_SAMPLINGTIME
#define ADIOS_ADC_SAMPLINGTIME LL_ADC_SAMPLINGTIME_144CYCLES
#endif

// DMA stream per instance. Unlike the G0, where DMAMUX lets any channel carry
// any request, each F4 ADC is hard-wired to a small set of DMA2 streams:
//
//     ADC1 -> DMA2 Stream0 Ch0  or  Stream4 Ch0
//     ADC2 -> DMA2 Stream2 Ch1  or  Stream3 Ch1
//     ADC3 -> DMA2 Stream0 Ch2  or  Stream1 Ch2
//
// The defaults below take the first free choice for each, which is why ADC3
// is on Stream1 and not on Stream0: Stream0 is ADC1's.
#ifndef ADIOS_ADC0_DMA_STREAM
#define ADIOS_ADC0_DMA_STREAM   LL_DMA_STREAM_0
#define ADIOS_ADC0_DMA_CHANNEL  LL_DMA_CHANNEL_0
#define ADIOS_ADC0_DMA_IRQn     DMA2_Stream0_IRQn
#define ADIOS_ADC0_DMA_IRQ_FUNC void DMA2_Stream0_IRQHandler(void)
#define ADIOS_ADC0_DMA_CLEAR()  do { LL_DMA_ClearFlag_TC0(DMA2); LL_DMA_ClearFlag_TE0(DMA2); LL_DMA_ClearFlag_HT0(DMA2); LL_DMA_ClearFlag_DME0(DMA2); LL_DMA_ClearFlag_FE0(DMA2); } while(0)
#endif

