AddictiveInstruments/ADIOS/adios/STM32F4xx/adios_adc.c
#ifndef ADIOS_ADC1_DMA_STREAM
#define ADIOS_ADC1_DMA_STREAM   LL_DMA_STREAM_2
#define ADIOS_ADC1_DMA_CHANNEL  LL_DMA_CHANNEL_1
#define ADIOS_ADC1_DMA_IRQn     DMA2_Stream2_IRQn
#define ADIOS_ADC1_DMA_IRQ_FUNC void DMA2_Stream2_IRQHandler(void)
#define ADIOS_ADC1_DMA_CLEAR()  do { LL_DMA_ClearFlag_TC2(DMA2); LL_DMA_ClearFlag_TE2(DMA2); LL_DMA_ClearFlag_HT2(DMA2); LL_DMA_ClearFlag_DME2(DMA2); LL_DMA_ClearFlag_FE2(DMA2); } while(0)
#endif

#ifndef ADIOS_ADC2_DMA_STREAM
#define ADIOS_ADC2_DMA_STREAM   LL_DMA_STREAM_1
#define ADIOS_ADC2_DMA_CHANNEL  LL_DMA_CHANNEL_2
#define ADIOS_ADC2_DMA_IRQn     DMA2_Stream1_IRQn
#define ADIOS_ADC2_DMA_IRQ_FUNC void DMA2_Stream1_IRQHandler(void)
#define ADIOS_ADC2_DMA_CLEAR()  do { LL_DMA_ClearFlag_TC1(DMA2); LL_DMA_ClearFlag_TE1(DMA2); LL_DMA_ClearFlag_HT1(DMA2); LL_DMA_ClearFlag_DME1(DMA2); LL_DMA_ClearFlag_FE1(DMA2); } while(0)
#endif


/////////////////////////////////////////////////////////////////////////////
// Local definitions
/////////////////////////////////////////////////////////////////////////////

#define NUM_CHANNELS_MAX 16

// how many of a mask's bits are set - computed at compile time so each
// instance's buffers are exactly the right size and nothing is wasted
#define POPCNT16(m) ( \
  (((m) >> 0) & 1) + (((m) >> 1) & 1) + (((m) >> 2) & 1) + (((m) >> 3) & 1) + \
  (((m) >> 4) & 1) + (((m) >> 5) & 1) + (((m) >> 6) & 1) + (((m) >> 7) & 1) + \
  (((m) >> 8) & 1) + (((m) >> 9) & 1) + (((m) >>10) & 1) + (((m) >>11) & 1) + \
  (((m) >>12) & 1) + (((m) >>13) & 1) + (((m) >>14) & 1) + (((m) >>15) & 1) )

#if defined(ADIOS_USE_ADC0)
# define NUM_CHN_0 POPCNT16(ADIOS_ADC0_CHANNEL_MASK)
#else
# define NUM_CHN_0 0
#endif
#if defined(ADIOS_USE_ADC1)
# define NUM_CHN_1 POPCNT16(ADIOS_ADC1_CHANNEL_MASK)
#else
# define NUM_CHN_1 0
#endif
#if defined(ADIOS_USE_ADC2)
# define NUM_CHN_2 POPCNT16(ADIOS_ADC2_CHANNEL_MASK)
#else
# define NUM_CHN_2 0
#endif

#define NUM_CHN_TOTAL (NUM_CHN_0 + NUM_CHN_1 + NUM_CHN_2)


/////////////////////////////////////////////////////////////////////////////
// Local types
/////////////////////////////////////////////////////////////////////////////

typedef struct {
  GPIO_TypeDef *port;
  u16           pin_mask;
} adc_pin_t;

typedef struct {
  ADC_TypeDef *adc;         // peripheral instance
  u32          dma_stream;
  u32          dma_channel;
  u16          chn_mask;    // which hardware channels are selected
  u8           num_chn;     // how many bits that is
  u8           slot_base;   // where this instance starts in the shared arrays
  u16         *raw;         // DMA landing zone for this instance
} adc_inst_t;


/////////////////////////////////////////////////////////////////////////////
// Local variables
/////////////////////////////////////////////////////////////////////////////

#if NUM_CHN_TOTAL

// The published state is one flat set of arrays covering every instance, in
// port order - slot_base says where each instance starts. The raw DMA
// landing zones stay separate, one per instance, because each DMA stream
// writes its own scan.
static u16 adc_channel_values[NUM_CHN_TOTAL];
static u32 adc_channel_changed[(NUM_CHN_TOTAL + 31) / 32];
#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
static u16 adc_values_sum[NUM_CHN_TOTAL];
static u8  oversampling_ctr[3];
#endif
#if ADIOS_ADC_DEADBAND_IDLE
static u16 adc_channel_idle_ctr[NUM_CHN_TOTAL];
#endif

#if NUM_CHN_0
static u16 adc_raw_0[NUM_CHN_0] __attribute__((aligned(4)));
#endif
#if NUM_CHN_1
static u16 adc_raw_1[NUM_CHN_1] __attribute__((aligned(4)));
#endif
#if NUM_CHN_2
static u16 adc_raw_2[NUM_CHN_2] __attribute__((aligned(4)));
#endif

static u16 adc_deadband;
static s32 (*service_prepare_callback)(void);

static adc_inst_t adc_inst[3];

// ADC1 and ADC2 share this map; ADC3 does not - see the header comment.
static const adc_pin_t pin_map_12[NUM_CHANNELS_MAX] = {
  { GPIOA, LL_GPIO_PIN_0  }, { GPIOA, LL_GPIO_PIN_1  },
  { GPIOA, LL_GPIO_PIN_2  }, { GPIOA, LL_GPIO_PIN_3  },
  { GPIOA, LL_GPIO_PIN_4  }, { GPIOA, LL_GPIO_PIN_5  },
  { GPIOA, LL_GPIO_PIN_6  }, { GPIOA, LL_GPIO_PIN_7  },
  { GPIOB, LL_GPIO_PIN_0  }, { GPIOB, LL_GPIO_PIN_1  },
  { GPIOC, LL_GPIO_PIN_0  }, { GPIOC, LL_GPIO_PIN_1  },
  { GPIOC, LL_GPIO_PIN_2  }, { GPIOC, LL_GPIO_PIN_3  },
  { GPIOC, LL_GPIO_PIN_4  }, { GPIOC, LL_GPIO_PIN_5  },
};

#if defined(ADIOS_USE_ADC2) && NUM_CHN_2
#if !defined(GPIOF)
# error "ADIOS_USE_ADC2 (ADC3) needs PORTF for channels 4..9, 14 and 15. This package has no PORTF - only ADC3 channels 0..3 and 10..13 are bonded, and the map below cannot be built."
#endif
static const adc_pin_t pin_map_3[NUM_CHANNELS_MAX] = {
  { GPIOA, LL_GPIO_PIN_0  }, { GPIOA, LL_GPIO_PIN_1  },
  { GPIOA, LL_GPIO_PIN_2  }, { GPIOA, LL_GPIO_PIN_3  },
  { GPIOF, LL_GPIO_PIN_6  }, { GPIOF, LL_GPIO_PIN_7  },
  { GPIOF, LL_GPIO_PIN_8  }, { GPIOF, LL_GPIO_PIN_9  },
  { GPIOF, LL_GPIO_PIN_10 }, { GPIOF, LL_GPIO_PIN_3  },
  { GPIOC, LL_GPIO_PIN_0  }, { GPIOC, LL_GPIO_PIN_1  },
  { GPIOC, LL_GPIO_PIN_2  }, { GPIOC, LL_GPIO_PIN_3  },
  { GPIOF, LL_GPIO_PIN_4  }, { GPIOF, LL_GPIO_PIN_5  },
};
#endif

// LL rank constants are not consecutive values, so they need a table
static const u32 seq_rank[NUM_CHANNELS_MAX] = {
  LL_ADC_REG_RANK_1,  LL_ADC_REG_RANK_2,  LL_ADC_REG_RANK_3,  LL_ADC_REG_RANK_4,
  LL_ADC_REG_RANK_5,  LL_ADC_REG_RANK_6,  LL_ADC_REG_RANK_7,  LL_ADC_REG_RANK_8,
  LL_ADC_REG_RANK_9,  LL_ADC_REG_RANK_10, LL_ADC_REG_RANK_11, LL_ADC_REG_RANK_12,
  LL_ADC_REG_RANK_13, LL_ADC_REG_RANK_14, LL_ADC_REG_RANK_15, LL_ADC_REG_RANK_16,
};

static const u32 seq_length[NUM_CHANNELS_MAX] = {
  LL_ADC_REG_SEQ_SCAN_DISABLE,        LL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS,  LL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS,  LL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS,  LL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS,  LL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS, LL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS, LL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS,
  LL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS, LL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS,
};


/////////////////////////////////////////////////////////////////////////////
// Local helpers
/////////////////////////////////////////////////////////////////////////////

//! Applies the deadband to one instance's freshly landed scan and flags what
//! moved. Shared by the (up to three) DMA interrupt handlers.
static void ADIOS_ADC_ScanComplete(u8 port)
{
  adc_inst_t *inst = &adc_inst[port];
  int i;
  u16 *src;

#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
  // no oversampler in this silicon: accumulate here
  u16 *acc = &adc_values_sum[inst->slot_base];
  if( oversampling_ctr[port] == 0 ) {
    for(i=0; i<inst->num_chn; ++i)
      acc[i] = inst->raw[i];
  } else {
    for(i=0; i<inst->num_chn; ++i)
      acc[i] += inst->raw[i];
  }

  if( ++oversampling_ctr[port] < ADIOS_ADC_OVERSAMPLING_RATE )
    return; // not a complete set yet
  oversampling_ctr[port] = 0;

  src = acc;
#else
  src = inst->raw;
#endif

  for(i=0; i<inst->num_chn; ++i) {
    u32 slot = inst->slot_base + i;

#if ADIOS_ADC_DEADBAND_IDLE
    // a channel that has been still for a while gets the wider band, so EMI
    // cannot wake up a knob nobody is touching
    u16 deadband = adc_channel_idle_ctr[slot] ? adc_deadband : ADIOS_ADC_DEADBAND_IDLE;
#else
    // the runtime deadband, not the compile-time constant: this branch must
    // still honour ADIOS_ADC_DeadbandSet()
    u16 deadband = adc_deadband;
#endif

    if( abs((s32)src[i] - (s32)adc_channel_values[slot]) > (s32)deadband ) {
      adc_channel_values[slot] = src[i];
      adc_channel_changed[slot >> 5] |= (1 << (slot & 0x1f));
#if ADIOS_ADC_DEADBAND_IDLE
      adc_channel_idle_ctr[slot] = ADIOS_ADC_IDLE_CTR;
#endif
    } else {
#if ADIOS_ADC_DEADBAND_IDLE
      if( adc_channel_idle_ctr[slot] )
        adc_channel_idle_ctr[slot] -= 1;
#endif
    }
  }
}


//! Configures one instance: pins, sequence, DMA. Returns the next free slot.
static u8 ADIOS_ADC_InstInit(u8 port, ADC_TypeDef *adc, u16 chn_mask, u8 num_chn,
                              u8 slot_base, u16 *raw,
                              const adc_pin_t *pin_map,
                              u32 dma_stream, u32 dma_channel, IRQn_Type dma_irqn)
{
  adc_inst_t *inst = &adc_inst[port];
  int c, rank;

  inst->adc = adc;
  inst->dma_stream = dma_stream;
  inst->dma_channel = dma_channel;
  inst->chn_mask = chn_mask;
  inst->num_chn = num_chn;
  inst->slot_base = slot_base;
  inst->raw = raw;

  if( !num_chn )
    return slot_base;

  // analog pins
  LL_GPIO_InitTypeDef GPIO_InitStructure;
  LL_GPIO_StructInit(&GPIO_InitStructure);
  GPIO_InitStructure.Mode = LL_GPIO_MODE_ANALOG;
  GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
  for(c=0; c<NUM_CHANNELS_MAX; ++c) {
    if( chn_mask & (1 << c) ) {
      GPIO_InitStructure.Pin = pin_map[c].pin_mask;
      LL_GPIO_Init(pin_map[c].port, &GPIO_InitStructure);
    }
  }

  LL_ADC_Disable(adc);
  LL_ADC_SetResolution(adc, LL_ADC_RESOLUTION_12B);
  LL_ADC_SetDataAlignment(adc, LL_ADC_DATA_ALIGN_RIGHT);
  LL_ADC_SetSequencersScanMode(adc, LL_ADC_SEQ_SCAN_ENABLE);

  // the regular sequence, in ascending channel order - which is what makes
  // slot N of the arrays the Nth set bit of the mask
  LL_ADC_REG_SetSequencerLength(adc, seq_length[num_chn - 1]);
  rank = 0;
  for(c=0; c<NUM_CHANNELS_MAX; ++c) {
    if( chn_mask & (1 << c) ) {
      u32 ll_chn = __LL_ADC_DECIMAL_NB_TO_CHANNEL(c);
      LL_ADC_REG_SetSequencerRanks(adc, seq_rank[rank], ll_chn);
      LL_ADC_SetChannelSamplingTime(adc, ll_chn, ADIOS_ADC_SAMPLINGTIME);
      ++rank;
    }
  }

  LL_ADC_REG_SetTriggerSource(adc, LL_ADC_REG_TRIG_SOFTWARE);
  LL_ADC_REG_SetContinuousMode(adc, LL_ADC_REG_CONV_SINGLE);
  LL_ADC_REG_SetDMATransfer(adc, LL_ADC_REG_DMA_TRANSFER_LIMITED);

