AddictiveInstruments/ADIOS/adios/STM32F4xx/adios_adc.c
  // DMA: peripheral to memory, one scan per request
  LL_DMA_SetChannelSelection(DMA2, dma_stream, dma_channel);
  LL_DMA_SetDataTransferDirection(DMA2, dma_stream, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
  LL_DMA_SetStreamPriorityLevel(DMA2, dma_stream, LL_DMA_PRIORITY_HIGH);
  LL_DMA_SetMode(DMA2, dma_stream, LL_DMA_MODE_NORMAL);
  LL_DMA_SetPeriphIncMode(DMA2, dma_stream, LL_DMA_PERIPH_NOINCREMENT);
  LL_DMA_SetMemoryIncMode(DMA2, dma_stream, LL_DMA_MEMORY_INCREMENT);
  LL_DMA_SetPeriphSize(DMA2, dma_stream, LL_DMA_PDATAALIGN_HALFWORD);
  LL_DMA_SetMemorySize(DMA2, dma_stream, LL_DMA_MDATAALIGN_HALFWORD);
  LL_DMA_ConfigAddresses(DMA2, dma_stream,
                         LL_ADC_DMA_GetRegAddr(adc, LL_ADC_DMA_REG_REGULAR_DATA),
                         (u32)raw,
                         LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
  LL_DMA_SetDataLength(DMA2, dma_stream, num_chn);
  LL_DMA_EnableIT_TC(DMA2, dma_stream);
  LL_DMA_EnableStream(DMA2, dma_stream);

  ADIOS_IRQ_Install(dma_irqn, ADIOS_IRQ_ADC_DMA_PRIORITY);

  LL_ADC_Enable(adc);

  return slot_base + num_chn;
}


//! Rearms one instance's DMA and triggers its scan.
static void ADIOS_ADC_InstStart(u8 port)
{
  adc_inst_t *inst = &adc_inst[port];

  if( !inst->num_chn )
    return;

  // the stream is in normal mode and stops after one scan: rearm it first
  LL_DMA_DisableStream(DMA2, inst->dma_stream);
  while( LL_DMA_IsEnabledStream(DMA2, inst->dma_stream) );
  LL_DMA_SetDataLength(DMA2, inst->dma_stream, inst->num_chn);
  LL_DMA_EnableStream(DMA2, inst->dma_stream);

  LL_ADC_REG_StartConversionSWStart(inst->adc);
}

#endif /* NUM_CHN_TOTAL */


/////////////////////////////////////////////////////////////////////////////
//! Initializes the ADC driver
//! \param[in] mode currently only mode 0 supported
//! \return < 0 if initialisation failed
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_Init(u32 mode)
{
  if( mode != 0 )
    return -1; // unsupported mode

#if !NUM_CHN_TOTAL
  return -1; // no channel selected
#else
  int i;
  u8 slot = 0;

  adc_deadband = ADIOS_ADC_DEADBAND;
  service_prepare_callback = NULL;

  for(i=0; i<NUM_CHN_TOTAL; ++i) {
    adc_channel_values[i] = 0;
#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
    adc_values_sum[i] = 0;
#endif
#if ADIOS_ADC_DEADBAND_IDLE
    adc_channel_idle_ctr[i] = 0;
#endif
  }
  for(i=0; i<(int)(sizeof(adc_channel_changed)/sizeof(u32)); ++i)
    adc_channel_changed[i] = 0;
  for(i=0; i<3; ++i) {
    adc_inst[i].num_chn = 0;
    adc_inst[i].adc = NULL;
#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
    oversampling_ctr[i] = 0;
#endif
  }

  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2);

  // the kernel clock lives in the common register block, shared by all three
  LL_ADC_SetCommonClock(__LL_ADC_COMMON_INSTANCE(ADC1), ADIOS_ADC_CLOCK_SOURCE);

#if NUM_CHN_0
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC1);
  slot = ADIOS_ADC_InstInit(0, ADC1, ADIOS_ADC0_CHANNEL_MASK, NUM_CHN_0,
                             slot, adc_raw_0, pin_map_12,
                             ADIOS_ADC0_DMA_STREAM, ADIOS_ADC0_DMA_CHANNEL,
                             ADIOS_ADC0_DMA_IRQn);
#endif
#if NUM_CHN_1
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC2);
  slot = ADIOS_ADC_InstInit(1, ADC2, ADIOS_ADC1_CHANNEL_MASK, NUM_CHN_1,
                             slot, adc_raw_1, pin_map_12,
                             ADIOS_ADC1_DMA_STREAM, ADIOS_ADC1_DMA_CHANNEL,
                             ADIOS_ADC1_DMA_IRQn);
#endif
#if NUM_CHN_2
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC3);
  slot = ADIOS_ADC_InstInit(2, ADC3, ADIOS_ADC2_CHANNEL_MASK, NUM_CHN_2,
                             slot, adc_raw_2, pin_map_3,
                             ADIOS_ADC2_DMA_STREAM, ADIOS_ADC2_DMA_CHANNEL,
                             ADIOS_ADC2_DMA_IRQn);
#endif

  ADIOS_ADC_StartConversions();

  return 0;
#endif
}


/////////////////////////////////////////////////////////////////////////////
//! Installs an optional "service prepare" callback, run before each scan.
//! The scan starts if it returns 0, and is skipped if it returns >= 1 -
//! which is how a caller inserts a settling delay after switching an
//! external analog source.
//! \return < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_ServicePrepareCallback_Init(void *_service_prepare_callback)
{
#if !NUM_CHN_TOTAL
  return -1;
#else
  service_prepare_callback = _service_prepare_callback;
  return 0;
#endif
}


/////////////////////////////////////////////////////////////////////////////
//! Returns the last published value of a channel, in HARDWARE channel
//! numbering - the same numbers used in ADIOS_ADCn_CHANNEL_MASK.
//! \param[in] port ADIOS_ADC_PORT_ADC0/1/2
//! \param[in] chn hardware channel number
//! \return < 0 if the port or channel is not enabled
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_ChannelGet(u8 port, u8 chn)
{
#if !NUM_CHN_TOTAL
  return -1;
#else
  adc_inst_t *inst;
  int c, rank;

  if( port >= 3 )
    return -1;

  inst = &adc_inst[port];
  if( !inst->num_chn || chn >= NUM_CHANNELS_MAX )
    return -1;
  if( !(inst->chn_mask & (1 << chn)) )
    return -1; // channel not enabled

  // slot = how many enabled channels come before this one
  rank = 0;
  for(c=0; c<chn; ++c)
    if( inst->chn_mask & (1 << c) )
      ++rank;

  return adc_channel_values[inst->slot_base + rank];
#endif
}


/////////////////////////////////////////////////////////////////////////////
//! \return the deadband currently used to notify changes
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_DeadbandGet(void)
{
#if !NUM_CHN_TOTAL
  return -1;
#else
  return adc_deadband;
#endif
}

/////////////////////////////////////////////////////////////////////////////
//! Sets the change a channel has to show before it is published.
//! \return < 0 on error
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_DeadbandSet(u16 deadband)
{
#if !NUM_CHN_TOTAL
  return -1;
#else
  adc_deadband = deadband;
  return 0;
#endif
}


/////////////////////////////////////////////////////////////////////////////
//! Calls the given callback for each channel that moved, then starts the
//! next scan:
//! \code
//!   void APP_ADC_NotifyChange(u32 port, u32 chn, u32 value)
//! \endcode
//! \return < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_Handler(void *_callback)
{
  if( _callback == NULL )
    return -1;

#if !NUM_CHN_TOTAL
  return -1;
#else
  int port, c, rank;
  void (*callback)(u32 port, u32 chn, u32 value) = _callback;

  for(port=0; port<3; ++port) {
    adc_inst_t *inst = &adc_inst[port];
    if( !inst->num_chn )
      continue;

    rank = 0;
    for(c=0; c<NUM_CHANNELS_MAX; ++c) {
      if( !(inst->chn_mask & (1 << c)) )
        continue;

      u32 slot = inst->slot_base + rank;
      u32 mask = 1 << (slot & 0x1f);
      if( adc_channel_changed[slot >> 5] & mask ) {
        ADIOS_IRQ_Disable();
        u32 value = adc_channel_values[slot];
        adc_channel_changed[slot >> 5] &= ~mask;
        ADIOS_IRQ_Enable();

        callback(port, c, value);
      }
      ++rank;
    }
  }

