AddictiveInstruments/ADIOS/adios/STM32F4xx/adios_adc.c
  // optional settling hook; skip the scan if it asks for more time
  if( service_prepare_callback != NULL && service_prepare_callback() >= 1 )
    return 0;

  ADIOS_ADC_StartConversions();

  return 0;
#endif
}


/////////////////////////////////////////////////////////////////////////////
//! Starts one scan on every enabled instance. Call this from a timer if the
//! periodic ADIOS_ADC_Handler() service has been disabled.
//! \return < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_ADC_StartConversions(void)
{
#if !NUM_CHN_TOTAL
  return -1;
#else
  int port;
  for(port=0; port<3; ++port)
    ADIOS_ADC_InstStart(port);
  return 0;
#endif
}


/////////////////////////////////////////////////////////////////////////////
//! DMA interrupts, one per enabled instance, raised once that instance's
//! whole scan has landed in memory.
//! \note not to be called from an application
/////////////////////////////////////////////////////////////////////////////
#if NUM_CHN_0
ADIOS_ADC0_DMA_IRQ_FUNC
{
  ADIOS_ADC0_DMA_CLEAR();
  ADIOS_ADC_ScanComplete(0);
#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
  if( oversampling_ctr[0] )
    ADIOS_ADC_InstStart(0); // more samples needed for this set
#endif
}
#endif

#if NUM_CHN_1
ADIOS_ADC1_DMA_IRQ_FUNC
{
  ADIOS_ADC1_DMA_CLEAR();
  ADIOS_ADC_ScanComplete(1);
#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
  if( oversampling_ctr[1] )
    ADIOS_ADC_InstStart(1);
#endif
}
#endif

#if NUM_CHN_2
ADIOS_ADC2_DMA_IRQ_FUNC
{
  ADIOS_ADC2_DMA_CLEAR();
  ADIOS_ADC_ScanComplete(2);
#if ADIOS_ADC_OVERSAMPLING_RATE >= 2
  if( oversampling_ctr[2] )
    ADIOS_ADC_InstStart(2);
#endif
}
#endif

//! \}

#endif /* ADC port selection valid */

#endif /* ADIOS_USE_ADC */
